test/perfGetAllUsers.txt
This is ApacheBench, Version 2.3 <$Revision: 1826891 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
1s:	3 connections
2s:	12 connections
3s:	12 connections
4s:	12 connections
5s:	12 connections
6s:	12 connections
7s:	12 connections
8s:	12 connections
9s:	12 connections
10s:	12 connections


Server Software:        
Server Hostname:        localhost
Server Port:            3000

Document Path:          /userlist
Document Length:        28052 bytes

Concurrency Level:      20
Time taken for tests:   10.007 seconds
Complete requests:      5029
Failed requests:        0
Total transferred:      142312324 bytes
HTML transferred:       141269872 bytes
Requests per second:    502.54 [#/sec] (mean)
Time per request:       39.797 [ms] (mean)
Time per request:       1.990 [ms] (mean, across all concurrent requests)
Transfer rate:          13887.87 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       4
Processing:    17   39   8.5     37     100
Waiting:       15   37   8.2     35      99
Total:         17   40   8.5     38     101

Percentage of the requests served within a certain time (ms)
  50%     38
  66%     41
  75%     43
  80%     45
  90%     49
  95%     55
  98%     63
  99%     69
 100%    101 (longest request)